from 读本地html import *
from make import make_docx
if len(指导学生) == 0:
    print('-------------------------------------------------------------')
    print('出错了！没检测到学生信息，或者你忘记了把实习备案系统中的网页粘贴到【河南省职业院校实习备案.html】中，请按照【说明.md】再试一下')
else:
    print('-------------------------------------------------------------')
    print('共检测到的学生个数：',len(指导学生))
    print('以上是从网页中提取的学生实习信息，正在制作文档，稍后可以在【layout】文件夹中查看完成的word文档')
    for obj in 指导学生:
        make_docx(obj)
        # print(obj)
    print('-------------------------------------------------------------')
    print('OK！所有文档制作完成，请移步【layout】文件夹中查看完成的word文档')